Repository: sshyran/xonoid
Catalog: locales/*.po
Languages: fi_fi

source: Too old PHP version (%s). Please update.
fi_fi: Liian vanha PHP:n versio (%s). Ole hyvä ja päivitä.

source: Extension '%s' not found!
fi_fi: Lisäosaa '%s' ei löytynyt!

source: Too old ZF (%s). Please update.
fi_fi: Liian vanha ZF (%s). Ole hyvä ja päivitä.

source: Manage
fi_fi: Hallitse

source: Edit
fi_fi: Muokkaa

source: Id
fi_fi: ID-numero

source: Title
fi_fi: Otsikko

source: Remove
fi_fi: Poista

source: Add
fi_fi: Lisää

source: Contact person
fi_fi: Yhteyshenkilö

source: Company name
fi_fi: Yrityksen nimi

source: Street
fi_fi: Katuosoite

source: ZIP Code
fi_fi: Postinumero

source: Post office
fi_fi: Postitoimisto

source: No rights.
fi_fi: Ei oikeuksia.

source: Given address exists already
fi_fi: Annettu osoite on jo olemassa

source: Remove company
fi_fi: Poista yritys

source: Street address
fi_fi: Katuosoite

source: Post number
fi_fi: Postinumero

source: Fail.
fi_fi: Epäonnistuminen.

source: Name
fi_fi: Nimi

source: Units
fi_fi: Räkkiyksikköä (U)

source: Responsible company
fi_fi: Vastuussa oleva yritys

source: Rack Unit Size
fi_fi: Räkkiyksikön koko (U)

source: Side
fi_fi: Puoli

source: Port type
fi_fi: Portin tyyppi

source: Front side
fi_fi: Edessä

source: Back side
fi_fi: Takana

source: IP Address
fi_fi: IP-osoite

source: CIDR
fi_fi: CIDR-notaatio

source: Mask
fi_fi: Aliverkon peite

source: Network
fi_fi: Verkko

source: IP Count
fi_fi: IP-osoitteiden määrä

source: IPv4 Address
fi_fi: IPv4-osoite

source: IP Adresses:
fi_fi: IP-osoitteet:

source: Log in
fi_fi: Kirjaudu

source: E-Mail
fi_fi: Sähköposti

source: Password
fi_fi: Salasana

source: Check email address
fi_fi: Tarkista sähköpostiosoite

source: Check password
fi_fi: Tarkista salasana

source: Reset password
fi_fi: Nollaa salasana

source: Your password has been reseted. New password: %s -- XoNoiD
fi_fi: Salasanasi on nollattu. Uusi salasana: %s -- XoNoiD

source: [XoNoiD] Reset password
fi_fi: [XoNoiD] Salasanan nollaus

source: Description
fi_fi: Kuvaus

source: Last name
fi_fi: Sukunimi

source: First name
fi_fi: Etunimi

source: Email
fi_fi: Sähköposti

source: Phone
fi_fi: Puhelinnumero

source: Add new user
fi_fi: Lisää uusi käyttäjä

source: Works in company
fi_fi: Työskentelee yrityksessä

source: Phone number
fi_fi: Puhelinnumero

source: Send login information
fi_fi: Lähetä kirjautumistiedot

source: You have been added. Login: %s Password: %s -- XoNoiD
fi_fi: Olit lisätty järjestelmään. Tunnus: %s Salasana: %s -- XoNoiD

source: [XoNoiD] Register
fi_fi: [XoNoiD] Rekisteröinti

source: Given e-mail address exists already
fi_fi: Annettu sähköpostiosoite on jo käytössä

source: Edit user
fi_fi: Muokkaa käyttäjää

source: Given e-mail address is in use
fi_fi: Annettu sähköpostiosoite on käytössä

source: Disabled
fi_fi: Pois päältä

source: Enabled
fi_fi: Päällä

source: Encryption:
fi_fi: Salaus:

source: Secure Socket Layer
fi_fi: Secure Socket Layer -salausprotokolla

source: Executed %s SQL queries in %s seconds
fi_fi: Suoritettiin %s SQL-kyselyä %s sekunnissa

source: Back
fi_fi: Takaisin

source: Add branch office for company %s
fi_fi: Lisää uusi haaratoimisto yritykselle %s

source: Add IP Address
fi_fi: Lisää IP-osoite

source: Add port for network device '%s'
fi_fi: Lisää portti verkkolaitteeseen '%s'

source: Add network device
fi_fi: Lisää verkkolaite

source: Add VLAN ID
fi_fi: Lisää VLAN-ID

source: Add new company billing information
fi_fi: Lisää uuden yrityksen laskutustiedot

source: Add company
fi_fi: Lisää yritys

source: Company list
fi_fi: Yrityslista

source: Add Network device
fi_fi: Lisää

source: Load PDF
fi_fi: Lataa PDF-tiedosto

source: Office's network devices
fi_fi: Toimiston verkkolaitteet

source: IPv4 addresses
fi_fi: IPv4-osoitteet

source: VLAN IDs
fi_fi: VLAN-ID:t

source: Add port to network device
fi_fi: Lisää portti verkkolaitteeseen

source: Network device's ports
fi_fi: Verkkolaitteiden portit

source: Add new customer for %s
fi_fi: Lisää uusi asiakas yritykselle %s

source: Add new branch office for %s
fi_fi: Lisää uusi haaratoimisto yritykselle %s

source: Add new user for %s
fi_fi: Lisää uusi käyttäjä %s

source: %s - Branch offices
fi_fi: Yrityksen %s haarakonttorit

source: %s - Customers
fi_fi: Yrityksen %s asiakkaat

source: Remove company '%s'
fi_fi: Poista yritys '%s'

source: Note
fi_fi: Huomaa

source: All data considering this company is removed.
fi_fi: Kaikki tieto koskien tätä yritystä poistetaan.

source: Forgot password?
fi_fi: Unohditko salasanasi?

source: Login
fi_fi: Kirjaudu

source: Login page
fi_fi: Kirjautumissivu

source: You'll be redirected to login page upon successful password reset.
fi_fi: Sinut ohjataan kirjautumissivulle kun salasanan nollaus sähköposti lähetetään.

source: Add ticket
fi_fi: Lisää tiketti

source: '%value%' has not only alphabetic and digit characters
fi_fi: '%value%' sisältää muita kuin aakkosia ja numeroita

source: '%value%' is an empty string
fi_fi: '%value%' on tyhjä merkkijono

source: '%value%' has not only alphabetic characters
fi_fi: '%value%' sisältää muita merkkejä kuin aakkosia

source: '%value%' is an invalid EAN-13 barcode
fi_fi: '%value%' on epäkelpo EAN-13-viivakoodi

source: '%value%' should be 13 characters
fi_fi: '%value%' pitäisi olla 13 merkkiä pitkä

source: '%value%' is an invalid UPC-A barcode
fi_fi: '%value%' on epäkelpo UPC-A-viivakoodi

source: '%value%' should be 12 characters
fi_fi: '%value%' pitäisi olla 12 merkkiä pitkä

source: '%value%' is not between '%min%' and '%max%', inclusively
fi_fi: '%value%' ei ole %min% ja %max% -arvojen välissä

source: '%value%' is not strictly between '%min%' and '%max%'
fi_fi: '%value%' ei ole %min% ja %max% -arvojen välissä

source: '%value%' must contain between 13 and 19 digits
fi_fi: '%value%' pitää olla 13-19 merkkiä pitkä

source: Luhn algorithm (mod-10 checksum) failed on '%value%'
fi_fi: '%value%' ei läpäissyt Luhn-algoritmia

source: '%value%' is not of the format YYYY-MM-DD
fi_fi: '%value%' ei ole muodossa VVVV-KK-PP

source: '%value%' does not appear to be a valid date
fi_fi: '%value%' ei ole kelvollinen päiväys

source: '%value%' does not fit given date format
fi_fi: '%value%' ei mahdu annettuun aikaformaattiin

source: '%value%' contains not only digit characters
fi_fi: '%value%' sisältää muita kuin numeroita

source: '%value%' is not a valid email address in the basic format local-part@hostname
fi_fi: '%value%' ei ole kelvollinen sähköpostiosoite

source: '%hostname%' is not a valid hostname for email address '%value%'
fi_fi: '%hostname%' ei ole kelvollinen sähköpostin domain osoitteelle '%value%'

source: '%hostname%' does not appear to have a valid MX record for the email address '%value%'
fi_fi: '%hostname%' ei sisällä kelvollista MX-tietuetta nimipalvelimella annetulle sähköpostiosoitteelle '%value%'

source: '%localPart%' is not a valid local part for email address '%value%'
fi_fi: '%value%' ei ole kelvollinen sähköpostiosoite

source: '%value%' does not appear to be a float
fi_fi: '%value%' ei ole kelvollinen liukuluku

source: '%value%' is not greater than '%min%'
fi_fi: '%value%' ei ole suurempi kuin '%min%'

source: '%value%' has not only hexadecimal digit characters
fi_fi: '%value%' sisältää muita kuin heksadesimaalisia merkkejä (0-9a-f)

source: '%value%' appears to be an IP address, but IP addresses are not allowed
fi_fi: '%value%' näyttää olevan IP-osoite, mutta IP-osoitteet eivät ole sallittuja

source: '%value%' does not match the expected structure for a DNS hostname
fi_fi: '%value%' ei vastaa domain-nimen rakennetta

source: '%value%' does not appear to be an integer
fi_fi: '%value%' ei ole kokonaisluku

source: '%value%' does not appear to be a valid IP address
fi_fi: '%value%' ei ole IP-osoite

source: '%value%' is not less than '%max%'
fi_fi: '%value%' ei ole pienempi kuin '%max%'

source: Value is empty, but a non-empty value is required
fi_fi: Pakollinen kenttä

source: '%value%' does not match against pattern '%pattern%'
fi_fi: '%value%' ei osu sääntöön '%pattern%'

source: '%value%' is less than %min% characters long
fi_fi: '%value%' on vähemmän kuin %min% merkkiä pitkä

source: '%value%' is greater than %max% characters long
fi_fi: '%value%' on pitempi kuin sallittu %max% merkkiä pitkä

source: Too much files, only '%value%' are allowed
fi_fi: Liian monta tiedostoa, vain %value% on sallittu

source: Too less files, minimum '%value%' must be given
fi_fi: Liian vähän tiedostoja, %value% pitää lähettää minimissään

source: The file '%value%' has a false extension
fi_fi: Tiedostolla '%value%' on väärä tai väärennetty tiedostopääte

source: The file '%value%' was not found
fi_fi: Tiedostoa '%value%' ei löytynyt

source: The files in sum exceed the maximum allowed size
fi_fi: Tiedostojen summa ylittää ylärajan

source: All files are in sum smaller than required
fi_fi: Kaikkien tiedostojen summa on pienempi kuin sallittu

source: One or more files can not be read
fi_fi: Yhtä tai useampaa tiedostoa ei voitu lukea

source: Width of the image '%value%' is bigger than allowed
fi_fi: Kuvan '%value%' leveys on suurempi kuin sallittu

source: Width of the image '%value%' is smaller than allowed
fi_fi: Kuvan '%value%' leveys on pienempi kuin sallittu

source: Height of the image '%value%' is bigger than allowed
fi_fi: Kuvan '%value%' pituus on suurempi kuin sallittu

source: Height of the image '%value%' is smaller than allowed
fi_fi: Kuvan '%value%' pituus on pienempi kuin sallittu

source: Size if the image '%value%' could not be detected
fi_fi: Kuvan '%value%' pituutta ja leveyttä ei saatu selville

source: The image '%value%' can not be read
fi_fi: Kuvaa '%value%' ei voitu lukea

source: The file '%value%' is bigger than allowed
fi_fi: Tiedosto '%value%' on suurempi kuin sallittu koko

source: The file '%value%' is smaller than allowed
fi_fi: Tiedosto '%value%' on pienempi kuin sallittu koko

source: The file '%value%' could not be found
fi_fi: Tiedostoa '%value%' ei löytynyt

source: The file '%value%' exceeds the defined ini size
fi_fi: Tiedoston '%value%' koko ylittää INI-tiedostossa määritetyn koon

source: The file '%value%' exceeds the defined form size
fi_fi: Tiedoston '%value%' koko ylittää lomakkeeseen asetetun koon

source: The file '%value%' was only partially uploaded
fi_fi: Tiedosto '%value%' ei saapunut perille kokonaisena

source: The file '%value%' was not uploaded
fi_fi: Tiedostoa '%value%' ei lähetetty

source: No temporary directory was found for the file '%value%'
fi_fi: Väliaikaista hakemistoa ei löydetty tiedostolle '%value%'

source: The file '%value%' can't be written
fi_fi: Tiedostoa '%value%' ei voida kirjoittaa

source: The extension returned an error while uploading the file '%value%'
fi_fi: Tiedostoa '%value%' lähetettäessä tiedostonkäsittelijä palautti virheen

source: The file '%value%' was illegal uploaded, possible attack
fi_fi: Tiedosto '%value%' lähetettiin järjestelmään epäkelvolla tavalla, tämä on mahdollinen hyökkäys

source: Unknown error while uploading the file '%value%'
fi_fi: Tuntematon virhe lähetettäessä tiedostoa '%value%'

source: Unknown error. Try again later
fi_fi: Tuntematon virhe. Koita myöhemmin uudestaan.

source: The provided CountryCode is invalid or the VAT number is empty
fi_fi: Maakoodi on virheellinen tai VAT-numero on tyhjä

source: The SOAP service is unavailable, try again later
fi_fi: SOAP-palvelu ei ole saatavilla, koita myöhemmin uudelleen

source: The service can't process your request. Try again later.
fi_fi: Palvelu ei voi käsitellä pyyntöäsi. Koita uudelleen myöhemmin.
